{
    "overview": {
        "hello": "Salut, je suis",
        "first_para": "Bienvenue dans mon monde nouveau visiteur !",
        "second_para": "Si tu es prêt à braver tous les dangers, attache ta ceinture et en avant toute !",
        "third_para": "N'hésite pas à jeter un oeil sur les différentes icônes pour en savoir plus sur moi et mon travail.",
        "embark": "Scrolle et embarque pour une visite"
    },
    "languages": {
        "french": "Français",
        "english": "Anglais"
    },
    "satellites": {
        "about_me": "À propos de moi",
        "skills": "Compétences",
        "experiences": "Expériences",
        "projects": "Projets",
        "contact_me": "Me contacter"
    },
    "not_found": {
        "user_lost": "Tu t'es sûrement perdu",
        "url_not_found": "Ce que tu recherches n'existe pas ou plus dans cet univers"
    },
    "portfolio": {
        "menu": "Menu"
    },
    "about_me": {
        "title": "À propos de moi",
        "subtitle": "En savoir un peu plus sur moi...",
        "type_writer_1": "Développeur dans le monde de l'IT",
        "type_writer_2": "Apprendre toujours de nouvelles choses",
        "first_para": "Ohhh tu es déjà là ?  Je serais ton guide tout au long de ton voyage ici. Tu peux m'appeler Astr0ruj !",
        "second_para": "Pour commencer la visite, quoi de mieux qu'une petite présentation de moi-même.",
        "third_para": "Je suis un ingénieur français de 26 ans qui a commencé sa carrière dans le monde de l'IA, du traitement d'images et de la vision par ordinateur.",
        "fourth_para": "Depuis 3 ans et demi, je suis un développeur frontend autodidacte dans le vaste monde du développement mobile et web.",
        "fifth_para": "Pourquoi ne pas apprendre le backend pour devenir bientôt un développeur full stack ?"
    },
    "skills": {
        "title": "Compétences",
        "subtitle": "Un résumé de ce que je sais faire...",
        "skill_title_1": "Mes débuts dans le développement",
        "skill_paragraph_1": "J'ai fait mes débuts dans le monde du développement à l'âge de 18 ans en apprenant le Python. \n\nCette expérience m'ayant plu, j'ai voulu continuer en intégrant un cycle préparatoire intégré et enfin une école d'ingénieur : ISEN Toulon. \nDurant ces années, j'ai pu apprendre à comprendre, à analyser et réfléchir à un code simple, compréhensible et propre en apprenant les bases du développement sur des technologies comme le C. \n\nJ'ai aussi pu en apprendre davantage en faisant notamment un stage au sein du groupe Atlantic avec l'équipe réseau et cybersécurité.",
        "skill_title_2": "Mon apprentissage autodidacte",
        "skill_paragraph_2": "Après une diplomation dans ma formation d'ingénieur en tant qu'ingénieur dans le traitement de l'image et l'intelligence artificielle et ne voyant pas ma future carrière dans ce domaine, j'ai décidé de m'orienter vers l'entrepreneuriat et le développement mobile et web de manière autodidacte avec le programme Pépite Toulon. \n\nJ'ai pu apprendre avec leur aide et par moi-même un peu plus sur le monde de l'entrepreneuriat et la programmation mobile avec notamment le framework Flutter durant une année.",
        "skill_title_3": "Années de développeur front",
        "skill_paragraph_3": "Après cette année concentrée sur ma montée en compétences autodidacte, j'ai décidé de découvrir et de m'épanouir dans le monde du travail avec un premier CDI au sein d'une start-up. \n\nCes années-là m'ont permis d'en apprendre beaucoup sur le développement front en mobile en Flutter, mais aussi dans d'autres technologies comme par exemple React native ou Kotlin en participant à des projets pour des clients jusqu'à devenir Lead dev front. \n\nJ'ai pu aussi de mon côté durant mon temps libre, améliorer mes compétences en faisant des projets personnels que ce soit mobile ou web.",
        "skill_title_4": "Et pourquoi pas développeur back ?",
        "skill_paragraph_4": "J'ai beaucoup parlé de ma montée en compétences dans le développement front, mais qu'en est-il du développement back ? \n\nJ'ai pu participer à des ajouts et modifications dans certains projets en faisant du Node js mais j'ai encore beaucoup à apprendre afin de devenir un développeur full stack.",
        "skill_title_5": "L'avenir...",
        "skill_paragraph_5": "Quelle aventure déjà ! Et la suite alors ? \n\nComme je l'ai dit, j'aimerais dans un futur proche, devenir un développeur full stack et par la suite de ma carrière, toujours prendre du plaisir dans ce que je fais et apprendre toujours de nouvelles choses et de nouvelles technologies.",
        "content_bitbucket": "Bitbucket est un service web d'hébergement et de gestion de développement logiciel utilisant le logiciel de gestion de versions Git.\n\nJe l'ai souvent utilisé afin d'héberger des projets de mon entreprise afin de les partager avec les différents développeurs de mon équipe.",
        "content_c": "C'est un langage de programmation impératif, généraliste et de bas niveau inventé au début des années 1970.\n\nDurant mes années d'études en école d'ingénieur, j'ai appris à programmer à travers différents projets avec ce language.",
        "content_firebase": "Firebase est un ensemble d'outils pour l'hébergement et le développement d'applications mobiles et web, qui permet l'envoi de notifications et de publicités, la remontée des erreurs et des clics effectués dans l'application.\n\nAvant de commencer à utiliser un back-end avec une ou plusieurs bases de données, j'ai commencé par me familiariser pour certains de mes projets avec une solution noSQL qui n'a pas besoin de back-end pour fonctionner avec le front-end.",
        "content_flutter": "Flutter est un kit de développement logiciel d'interface utilisateur open-source créé par Google lancé en 2018.\n\nDepuis que j'ai commencé le développement mobile, j'utilise le plus souvent ce framework pour sa facilité d'utilisation, ses performances et surtout pour sa communauté et sa riche documentation.",
        "content_github": "GitHub est une plateforme d'hébergement de code pour le contrôle des versions et la collaboration.\n\nJe l'utilise quotidiennement pendant mon temps libre lorsque je décide de travailler sur un de mes projets personnels.",
        "content_mysql": "MySQL est un système de gestion de bases de données relationnelles.\n\nUne base de données SQL avec laquelle j'ai l'habitude de travailler pour le développement mobile.",
        "content_nodejs": "Node.js est une plateforme logicielle libre en JavaScript, orientée vers les applications réseau évènementielles hautement concurrentes qui doivent pouvoir monter en charge.\n\nTrès souvent utilisé dans les projets dans lesquels j'ai pu travailler pour le côté back-end. Encore novice sur ce framework, je veux en savoir plus très vite !",
        "content_postman": "Postman est une application permettant de tester des API.\n\nAfin de faciliter la rapidité de développement et le câblage du back-end sur le front-end d'une application, je l'utilise quotidiennement.",
        "content_python": "Python est un langage de programmation interprété, multiparadigme et multiplateformes. Il favorise la programmation impérative structurée, fonctionnelle et orientée objet.\n\nCe language m'a fait découvrir le développement et m'a suivi jusqu'à la fin de mes études avec le machine learning, le traitement de l'image,...",
        "content_reactnative": "React Native est un framework d'applications mobiles open source créé par Facebook.\n\nUne autre alternative pour le développement mobile que j'ai pu utiliser dans certains projets professionnels.",
        "content_reactjs": "React est une bibliothèque JavaScript libre développée par Facebook depuis 2013. Le but principal de cette bibliothèque est de faciliter la création d'application web monopage.\n\nImportant d'apprendre et avoir des notions dans le développement web de nos jours. Et bien ce portfolio utilise ce framework !",
        "content_reactredux": "React Redux est la couche de liaison officielle de React UI pour Redux. Elle permet à vos composants React de lire des données à partir d'un magasin Redux et d'envoyer des actions au magasin pour mettre à jour l'état.\n\nQue ce soit dans mes projets en React native ou en React js, si j'ai besoin de state app management, React redux m'est indispensable dans le développement de mon projet !",
        "content_sequelize": "Sequelize (également connu sous le nom de SequelizeJS) est un framework ORM qui permet de connecter et de faire correspondre votre application Node. js à une base de données.\n\nEncore peu utilisé étant un novice dans le développement back-end, je sais pourtant que c'est une arme puissante combinée à Node js !",
        "content_sourcetree": "Développé par Atlassian, SourceTree, est un logiciel avec GUI permettant de quasiment tout gérer sans passer par le terminal tout en vous facilitant la tâche.\n\nJ'utilise Git Graph lorsque je travaille sur mes projets personnels avec GitHub, mais SourceTree est une très bonne alternative pour suivre l'avancement de chacun avec des projets mis sur Bitbucket.",
        "content_threejs": "Three.js est une bibliothèque JavaScript pour créer des scènes 3D dans un navigateur web.\n\nUn peu compliqué au début de gérer du 3D dans une application en 2D mais le résultat en vaut la peine, non ?",
        "content_kotlin": "Kotlin est un langage de programmation orienté objet et fonctionnel, avec un typage statique.\n\nUne alternative pour le développement mobile natif Android que j'ai pu utiliser dans certains projets professionnels."
    },
    "experiences": {
        "title": "Expériences",
        "subtitle": "Ce que j'ai pu faire jusqu'à présent...",
        "title_experience_1": "Lead dev front",
        "company_experience_1": "Digital Paca",
        "date_experience_1": "2021 - Décembre 2023",
        "point_1_experience_1": "Développement from scratch d'une solution mobile Android / iOS et web de dons de vaccins entre médecins / pharmaciens, etc... Référence: Sauve mon vaccin",
        "point_2_experience_1": "Refonte / Amélioration avec design imposé par le client d'une solution mobile Android / iOS de réservation de croisières. Référence: Corsica Ferries",
        "point_3_experience_1": "Développement from scratch d'une application mobile Android / iOS afin de visualiser les informations des tournois sportifs organisés par le client. Référence: Madewis",
        "point_4_experience_1": "Développement from scratch d'une solution mobile Android / iOS d'un réseau social pour rencontrer des gens ayant les mêmes centres d'interêt. Référence: Hobbies",
        "point_5_experience_1": "Développement from scratch pour un organisme français d'une solution mobile Android / iOS pour faciliter la visualisation des présents / absents lors des formations. Référence: La croix rouge française",
        "title_experience_2": "Étudiant entrepreneur",
        "company_experience_2": "Pépite Toulon",
        "date_experience_2": "2020 - 2021",
        "point_1_experience_2": "Apprentissage de manière autodidacte du développement mobile",
        "point_2_experience_2": "Création d'une première version d'une application from scratch",
        "title_experience_3": "Stage ingénieur",
        "company_experience_3": "Groupe Atlantic",
        "date_experience_3": "Juillet 2019 - Octobre 2019",
        "point_1_experience_3": "Élaboration de la stratégie cybersécurité de l'entreprise",
        "title_experience_4": "Expert technique applications mobiles",
        "company_experience_4": "CGI",
        "date_experience_4": "Avril 2024 - Aujourd'hui"
    },
    "projects": {
        "title_pro": "Projets professionnels",
        "subtitle_pro": "Quelques références de projets réalisés...",
        "title_private": "Projets personnels",
        "subtitle_private": "Quelques autres projets durant mon temps libre...",
        "title_project_pro_1": "Sauve mon vaccin",
        "content_project_pro_1": "Développement from scratch d'une solution mobile Android/iOS et web en Flutter de dons de vaccins entre médecins/pharmaciens,...",
        "title_project_pro_2": "Corsica Ferries",
        "content_project_pro_2": "Refonte/Amélioration avec design imposé par le client d'une solution mobile Android/iOS en React native de réservation de croisières.",
        "title_project_pro_3": "Madewis",
        "content_project_pro_3": "Développement from scratch d'une application mobile Android/iOS en Flutter afin de visualiser les informations des tournois sportifs organisés par le client.",
        "title_project_pro_4": "Hobbies",
        "content_project_pro_4": "Développement from scratch d'une solution mobile Android/iOS en Flutter d'un réseau social pour rencontrer des gens ayant les mêmes centres d'interêt.",
        "title_project_pro_5": "La croix rouge française",
        "content_project_pro_5": "Développement from scratch pour un organisme français d'une solution mobile Android/iOS en Flutter pour faciliter la visualisation des présents/absents lors des formations.",
        "title_project_perso_1": "Gemu",
        "content_project_perso_1": "Version 1 d'une application de réseau social pour les personnes intéressées par l'e-sport et les jeux vidéo développés en Flutter reliée à un serveur Firebase. Pourquoi pas une version 2, affaire à suivre...",
        "title_project_perso_2": "My youkounkoun",
        "content_project_perso_2": "Une application dotée d'une grande variété de fonctions de base et de fonctions complexes très utiles lors de la création d'une nouvelle application. Pourquoi repartir de zéro à chaque fois ? L'application front-end est développée avec Flutter et le back-end sera développé en Node.js en lien avec la base de données MySQL.",
        "title_project_perso_3": "Portfolio 3D",
        "content_project_perso_3": "Site et portfolio personnel afin de montrer mon travail à tous. Ce site est développé en React js avec du Three js.",
        "title_project_perso_4": "Bot discord",
        "content_project_perso_4": "Bot discord pour un serveur dédié à un jeu. Ce bot est développé en Node.js, une base de données mySQL et hébergé sur Heroku.",
        "title_context_project": "Contexte",
        "title_challenges_project": "Challenges",
        "title_results_project": "Résultats",
        "content_context_smv": "Dans le contexte actuel de santé globale, l'échange et le don de vaccins entre professionnels de santé tels que les médecins et pharmaciens est crucial. Afin de faciliter et d'optimiser ces échanges, nous avons développé, à partir de zéro, une solution mobile et web complète en utilisant Flutter. Cette application est compatible à la fois avec les systèmes d'exploitation Android et iOS.",
        "challenges_content_smv": "Le développement de cette application a comporté plusieurs défis. Le premier était d'assurer une expérience utilisateur homogène et fluide sur tous les types de dispositifs, que ce soit des smartphones, des tablettes ou des navigateurs web. Ensuite, garantir la sécurité et la confidentialité des informations sensibles telles que les données personnelles et les détails des transactions de vaccins était également primordial. Un autre challenge résidait dans la mise en place d'un système de suivi en temps réel pour assurer que les dons atteignent effectivement les bénéficiaires de manière rapide et efficace.",
        "results_content_smv": "Grâce à une approche centrée sur l'utilisateur et une attention particulière aux détails, le projet a connu un succès significatif. L'application offre désormais une interface intuitive qui permet aux médecins et pharmaciens de naviguer facilement pour faire des dons de vaccins. Les mécanismes de sécurité robustes garantissent que toutes les transactions et les données personnelles sont protégées. De plus, grâce au système de suivi en temps réel, les utilisateurs peuvent s'assurer que les dons de vaccins sont livrés de manière efficace. En conséquence, l'application a non seulement facilité les échanges de vaccins, mais a également contribué à renforcer la confiance et la collaboration entre les professionnels de santé.",
        "content_context_cf": "Dans le cadre d'une initiative visant à améliorer l'expérience utilisateur, notre équipe a été mandatée pour la refonte d'une application mobile existante de réservation de croisières. L'application, destinée à la fois aux utilisateurs Android et iOS, est développée en React Native. Le client nous a imposé un design spécifique, souhaitant ainsi garantir une esthétique et une cohérence avec son image de marque.",
        "challenges_content_cf": "Le principal défi de ce projet était d'intégrer le design imposé par le client tout en améliorant la fluidité et la fonctionnalité de l'application. Il était essentiel de veiller à ce que la nouvelle interface utilisateur soit à la fois attrayante et intuitive. En outre, nous avons dû travailler sur l'optimisation des performances de l'application pour réduire les temps de chargement et améliorer l'expérience globale de réservation. La compatibilité entre les différentes plateformes (Android et iOS) était également un aspect crucial à prendre en considération.",
        "results_content_cf": "La refonte a été couronnée de succès, avec une application désormais en parfaite adéquation avec les attentes visuelles du client. L'interface utilisateur a été grandement améliorée, rendant le processus de réservation de croisières plus fluide et agréable pour les utilisateurs. Les retours ont été très positifs, avec une augmentation notable de l'engagement utilisateur et une meilleure évaluation de l'application sur les boutiques en ligne. L'application optimisée offre désormais une expérience de navigation et de réservation rapide, fiable et conforme à l'identité visuelle souhaitée par le client.",
        "content_context_madewis": "Face à la nécessité d'une plateforme permettant aux passionnés de sport d'accéder facilement aux informations sur les tournois organisés, notre client nous a confié la tâche de développer une application mobile à partir de zéro. Cette application, conçue pour les systèmes Android et iOS, a été développée en Flutter afin de garantir une expérience utilisateur cohérente et réactive sur toutes les plateformes.",
        "challenges_content_madewis": "Le développement de l'application comportait plusieurs défis. Premièrement, il était essentiel de créer une interface utilisateur intuitive qui permet aux utilisateurs d'accéder facilement aux informations des différents tournois, comme les horaires, les équipes participantes, les scores, et plus encore. Deuxièmement, étant donné la diversité des sports et des tournois organisés par le client, l'application devait être suffisamment flexible pour s'adapter à différents formats et types de données. Enfin, la mise à jour en temps réel des informations des tournois était un élément clé pour garantir l'exactitude et la pertinence des données affichées.",
        "results_content_madewis": "Le projet a été un véritable succès, aboutissant à une application mobile qui non seulement répond aux besoins spécifiques du client, mais offre également une expérience utilisateur exceptionnelle. L'application permet désormais aux utilisateurs de naviguer facilement à travers une variété de tournois sportifs, de visualiser des informations détaillées et de recevoir des mises à jour en temps réel. La flexibilité et la réactivité de l'application ont été particulièrement appréciées, permettant une adaptation aisée à différents événements sportifs. Les retours des utilisateurs ont été positifs, soulignant la facilité d'utilisation et la fiabilité des informations fournies.",
        "content_context_hobbies": "Afin de répondre à un besoin croissant de socialisation autour de centres d'intérêt communs, nous avons entrepris le développement, à partir de zéro, d'une application mobile dédiée. Cette plateforme, conçue comme un réseau social, vise à connecter des personnes partageant les mêmes passions et hobbies. L'application, disponible à la fois sur Android et iOS, a été développée en utilisant Flutter, permettant ainsi une expérience utilisateur unifiée et cohérente sur les deux systèmes d'exploitation.",
        "challenges_content_hobbies": "Le projet a présenté plusieurs défis. D'abord, il était crucial de concevoir une interface utilisateur intuitive et attrayante pour encourager les utilisateurs à s'inscrire et à interagir les uns avec les autres. Le deuxième défi consistait à mettre en place des algorithmes efficaces de mise en relation, afin de s'assurer que les utilisateurs puissent trouver des correspondances pertinentes basées sur leurs centres d'intérêt. En outre, la gestion de la confidentialité et de la sécurité des données des utilisateurs était également une priorité, étant donné la nature sociale de l'application.",
        "results_content_hobbies": "Le résultat est une application mobile conviviale et engageante qui réussit à connecter les utilisateurs de manière significative. Grâce à son interface épurée et facile à utiliser, les utilisateurs peuvent rapidement créer des profils, énumérer leurs centres d'intérêt et commencer à interagir avec des personnes partageant des passions similaires.",
        "content_context_crf": "Pour un organisme de formation français, nous avons été chargés de développer une solution mobile de gestion des présences et absences lors des sessions de formation. L'objectif était de créer, à partir de zéro, une application accessible aussi bien sur Android qu'iOS, en utilisant Flutter, pour permettre aux formateurs de facilement visualiser et enregistrer la participation des stagiaires.",
        "challenges_content_crf": "Plusieurs défis se sont présentés au cours du développement de cette application. Le premier était de créer une interface utilisateur claire et intuitive, permettant aux formateurs de rapidement identifier les présents et les absents tout en minimisant les erreurs de saisie. De plus, il était essentiel d'assurer une synchronisation en temps réel avec la base de données de l'organisme, afin de garantir l'exactitude et la cohérence des informations sur la participation.",
        "results_content_crf": "Le projet a abouti à une application mobile efficace et conviviale qui répond aux besoins spécifiques de l'organisme de formation. L'interface utilisateur simplifiée permet aux formateurs de rapidement visualiser et marquer les présences et absences des stagiaires, facilitant ainsi le processus d'enregistrement. La synchronisation en temps réel avec la base de données assure que toutes les informations sont à jour et précises.",
        "content_context_gemu": "En tant qu'étudiant entrepreneur passionné par l'e-sport et les jeux vidéo, j'ai entrepris le développement d'une application mobile destinée à créer une communauté autour de ces thématiques. Pendant un an, tout en apprenant Flutter, j'ai travaillé à la création de la version 1 de cette application. Celle-ci, développée en Flutter et reliée à un serveur Firebase, vise à connecter les amateurs d'e-sport et de jeux vidéo à travers un réseau social dédié.",
        "challenges_content_gemu": "Ce projet personnel a représenté plusieurs défis. D'une part, apprendre Flutter tout en développant l'application a été une expérience enrichissante, mais exigeante. D'autre part, concevoir une expérience utilisateur captivante et fonctionnelle, capable de rassembler une communauté diversifiée autour des jeux vidéo et de l'e-sport, nécessitait une attention particulière. De plus, l'intégration avec Firebase pour gérer les données en temps réel, l'authentification des utilisateurs, et d'autres fonctionnalités backend a été une étape cruciale du projet.",
        "results_content_gemu": "La version 1 de l'application a vu le jour avec succès, reflétant à la fois mon parcours d'apprentissage en développement mobile et ma passion pour l'e-sport. L'application offre aux utilisateurs une plateforme où ils peuvent échanger, se connecter, et partager leurs expériences liées aux jeux vidéo. Bien que ce soit une première version et qu'il y ait encore des améliorations possibles, l'application a déjà réussi à créer un espace positif pour les amateurs d'e-sport. L'expérience acquise au cours de ce projet a ouvert la voie à des possibilités d'amélioration et d'expansion, suggérant qu'une version 2 pourrait être envisagée à l'avenir.",
        "content_context_myy": "En tant que développeur passionné, j'ai identifié un besoin récurrent dans la communauté : celui de disposer d'une base solide et polyvalente pour démarrer rapidement le développement de nouvelles applications. Afin de répondre à ce besoin, j'ai consacré mon temps libre à la création d'une application dotée d'une large gamme de fonctions, tant basiques que complexes. Bien que cette application ne soit pas destinée à être déployée sur les stores, elle est conçue comme un projet open source pour aider d'autres développeurs à gagner du temps. Le front-end de l'application est développé avec Flutter, tandis que le back-end est conçu en Node.js, en lien avec une base de données MySQL.",
        "challenges_content_myy": "Le projet a impliqué plusieurs défis, notamment la création d'une architecture modulaire et facilement extensible. Il était essentiel de concevoir une base qui soit à la fois complète en termes de fonctionnalités et suffisamment flexible pour s'adapter à divers besoins. Intégrer des fonctionnalités complexes tout en maintenant une simplicité d'utilisation était un équilibre délicat à trouver. De plus, le code devait être bien commenté et documenté pour assurer sa compréhension et sa facilité d'utilisation par d'autres développeurs.",
        "results_content_myy": "Le résultat est une application open source robuste et polyvalente, qui sert de point de départ idéal pour divers projets. Elle intègre une multitude de fonctionnalités de base, telles que l'authentification des utilisateurs, la gestion de profils, ainsi que des fonctionnalités plus complexes et utiles pour divers cas d'usage. Grâce à son architecture bien pensée, les développeurs peuvent facilement ajouter, modifier ou supprimer des composants selon leurs besoins spécifiques. En mettant à disposition cette application comme ressource open source, j'espère contribuer à la communauté de développeurs en leur permettant de gagner du temps et d'optimiser leurs efforts lors de la création de nouvelles applications.",
        "content_context_portfolio": "Afin de disposer d'une plateforme pour présenter mon travail et mes compétences de manière professionnelle et créative, j'ai décidé de consacrer mon temps libre à la création de mon propre site et portfolio personnel. Le site, conçu pour mettre en avant mes projets et mon expertise, a été développé en utilisant React.js et intègre des éléments graphiques 3D réalisés avec Three.js.",
        "challenges_content_portfolio": "Le développement de mon site portfolio a comporté plusieurs défis intéressants. Le premier était de créer une interface qui soit à la fois esthétiquement plaisante et fonctionnelle, capable de refléter mon identité en tant que développeur. L'intégration de Three.js pour ajouter des éléments 3D interactifs représentait également un challenge, car je souhaitais que ces éléments apportent une dimension immersive sans surcharger le site. De plus, le site devait être optimisé pour une navigation fluide et une compatibilité multi-navigateurs.",
        "results_content_portfolio": "Le résultat est un site et portfolio personnel élégant et interactif qui met efficacement en lumière mon travail et mes compétences. Les éléments 3D, intégrés grâce à Three.js, ajoutent une touche distinctive et immersive, permettant aux visiteurs de s'engager de manière plus dynamique avec le contenu. La structure du site, construite avec React.js, assure une navigation fluide et réactive. Ce projet, réalisé sur mon temps libre, est non seulement un reflet de mes compétences techniques, mais aussi de ma créativité et de mon engagement envers mon développement professionnel.",
        "content_context_bot": "En tant que passionné de jeu vidéo, j'ai décidé de créer un bot Discord pour un serveur de jeux vidéo entre amis. Ce bot, développé en Node.js, est conçu pour avoir des informations relatives à un jeu vidéo sur les personnages, les armes et les accessoires au niveau de leurs statistiques qui vont changer chaque saison.",
        "challenges_content_bot": "Le projet a comporté plusieurs défis. Premièrement, il était essentiel de concevoir une architecture modulaire et flexible, permettant d'ajouter facilement de nouvelles fonctionnalités. Deuxièmement, le bot devait être capable de gérer plusieurs commandes simultanément, tout en maintenant une vitesse de réponse rapide. Enfin, il a fallu héberger facilement et proprement ce bot afin qu'il puisse répondre à n'importe quel moment.",
        "results_content_bot": "Le résultat est un bot Discord robuste et polyvalent, qui a grandement amélioré l'expérience des utilisateurs du serveur afin d'avoir toutes les informations dont ils ont besoin. Grâce à son architecture modulaire, le bot peut facilement être étendu pour ajouter de nouvelles fonctionnalités. De plus, il est capable de gérer plusieurs commandes simultanément, tout en maintenant une vitesse de réponse rapide.",
        "repository": "GitHub"
    },
    "contact_me": {
        "title": "Me contacter",
        "subtitle": "N'hésite pas à me poser la moindre question ou à me faire un retour...",
        "title_name": "Ton nom",
        "label_name": "Quel est ton nom ?",
        "title_firstname": "Ton prénom",
        "label_firstname": "Quel est ton prénom ?",
        "title_post": "Ton poste / métier",
        "label_post": "Quel est ton poste / métier ?",
        "title_email": "Ton email",
        "label_email": "Quel est ton email ?",
        "title_message": "Ton message",
        "label_message": "Que veux-tu dire ?",
        "send": "Envoyer",
        "loading_send": "Envoi en cours...",
        "title_validate": "Mail envoyé",
        "content_validate": "Merci. Je te répondrai dans les plus brefs délais.",
        "title_error": "Erreur",
        "content_error_1": "Les champs ne sont pas tous remplis.",
        "content_error_2": "Quelque chose n'a pas fonctionné."
    }
}